---
kind: method
id: M:Autodesk.Revit.DB.Structure.AnalyticalElement.IsSingleCurve
source: html/b9d6eb46-2e7d-4501-004e-704b69600d1f.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalElement.IsSingleCurve Method

Indicates if the Analytical Element can be expressed as a single curve.

## Syntax (C#)
```csharp
public bool IsSingleCurve()
```

## Returns
True if Analytical Element can be expressed as a single curve, false otherwise.